Repository: LianthSoftware/Leatha.Portfolio
Catalog: Leatha.Portfolio.Blazor.WebAssembly/Resources/SharedResource.*.resx
Languages: cs

# resources_common_job_title
source: IT Software Developer
cs: IT Software Vývojář

# resource_common_accepting_offers_label
source: Currently accepting offers!
cs: Přijímám nabídky!

# resource_common_contact_button
source: Contact
cs: Kontakt

# resource_common_download_button
source: Download CV
cs: Stáhnout CV

# resource_common_section_about_description_1_label
source: Hello! 😊
cs: Ahoj! 😊

# resource_common_section_about_description_2_label
source: My name is David, and I am a seasoned developer with over 15 years of programming experience. I have a strong passion for C# and the entire .NET ecosystem, which I’ve made my primary choice for solving a wide range of problems and building solutions.
cs: Jmenuji se David a jsem zkušený vývojář s více než 15 lety praxe v programování. Mám velkou vášeň pro C# a celý ekosystém .NET, který jsem si zvolil jako hlavní nástroj pro řešení široké škály problémů a tvorbu softwarových řešení.

# resource_common_section_about_description_3_label
source: I’m always looking to grow — exploring new technologies, reading industry articles, and watching tech-focused videos.
cs: Stále se snažím profesně růst — objevovat nové technologie, číst odborné články a sledovat videa zaměřená na moderní trendy v IT.

# resource_common_section_about_description_4_label
source: Outside of coding, I enjoy sports and social activities. From Frisbee and netball to team events like laser tag, escape rooms, and pub gatherings, I like staying active and connecting with others. Still, sometimes I’m perfectly happy just relaxing on the couch and watching movies or playing games.
cs: Mimo programování se rád věnuji sportu a společenským aktivitám. Ať už jde o frisbee nebo netball, týmové akce jako laser game, únikové hry či posezení v hospodě, baví mě být aktivní a trávit čas s lidmi. A přesto jsem někdy naprosto spokojený jen doma na gauči při sledování filmů nebo hraní her.

# resource_common_section_about_title
source: About
cs: O mě

# resource_common_years_subtitle
source: years old
cs: let

# resource_common_show_more_button
source: Show more
cs: Zobrazit více

# resource_common_show_more_total_label
source: (Total {0})
cs: (Celkem {0})

# resource_common_tech_table_years_label
source: (In years)
cs: (V letech)

# resource_common_section_projects_title
source: Projects
cs: Projekty

# resource_common_section_technologies_title
source: Technologies
cs: Technologie

# resource_common_tech_table_operating_systems_title
source: Operating Systems
cs: Operační Systémy

# resource_common_tech_table_analysis_design_title
source: Analysis & Design
cs: Analýza & Design

# resource_common_tech_table_project_control_title
source: Project Control
cs: Projektové Řízení

# resource_common_tech_table_code_flow_title
source: Code Flow
cs: Kódové Řízení

# resource_common_tech_table_databases_title
source: Databases
cs: Databáze

# resource_common_tech_table_programming_languages_title
source: Programming Languages
cs: Programovací Jazyky

# resource_common_tech_table_web_technologies_title
source: Web Technologies
cs: Webové Technologie

# resource_common_tech_table_mobile_technologies_title
source: Mobile Technologies
cs: Mobilní Technologie

# resource_common_tech_table_game_technologies_title
source: Game Technologies
cs: Herní Technologie

# resource_common_tech_table_other_title
source: Other
cs: Jiné

# resource_common_tech_table_currently_learning_title
source: Currently Learning
cs: Učím se

# resource_common_tech_table_area_header
source: Area
cs: Oblast

# resource_common_tech_table_technology_header
source: Technology
cs: Technologie

# resource_common_tech_table_experience_header
source: Experience
cs: Zkušenost

# resource_common_tech_table_notes_header
source: Notes
cs: Poznámky

# resource_common_tech_table_operating_systems_description
source: Windows for daily use; I also explore Linux out of curiosity.
cs: Windows pro každodenní práci; Linux zkoumám ze zvědavosti.

# resource_common_tech_table_analysis_design_description
source: Designing new features and analyzing issues and defects.
cs: Návrh nových funkcí a analýza problémů i defektů.

# resource_common_tech_table_project_control_description
source: Project and collaboration tools supporting successful delivery.
cs: Projektové a kolaborační nástroje podporující úspěšné dodávky.

# resource_common_tech_table_code_flow_description
source: Started with SVN, moved to Git. Using Azure DevOps CI/CD pipelines on projects.
cs: Začínal jsem se SVN, poté přešel na Git. Na projektech využívám CI/CD pipelines v Azure DevOps.

# resource_common_tech_table_databases_description
source: Databases I’ve worked with—most commonly MongoDB and SQL Server (Entity Framework).
cs: Databáze, se kterými pracuji—nejčastěji MongoDB a SQL Server (Entity Framework).

# resource_common_tech_table_programming_languages_description
source: C# has been my favourite since early on. I’ve also worked with Java and Python, and spent a few years improving private World of Warcraft servers.
cs: C# je už od začátku můj nejoblíbenější jazyk. Pracoval jsem také s Javou a Pythonem a několik let jsem zlepšoval privátní servery World of Warcraft.

# resource_common_tech_table_web_technologies_description
source: I’ve worked with many web technologies in the .NET ecosystem. I also write JavaScript by hand and prefer SASS over plain CSS.
cs: Mám zkušenosti s řadou webových technologií v ekosystému .NET. Píšu i čistý JavaScript a dávám přednost SASS před klasickým CSS.

# resource_common_tech_table_mobile_technologies_description
source: I’ve also done mobile development across what .NET offers.
cs: Věnoval jsem se i mobilnímu vývoji v rámci .NET.

# resource_common_tech_table_game_technologies_description
source: I’ve gained extensive experience in game development—early on with a World of Warcraft emulator; now I’m an avid Godot user.
cs: Získal jsem bohaté zkušenosti s vývojem her—na začátku zejména s emulátorem World of Warcraft; nyní jsem nadšeným uživatelem Godotu.

# resource_common_tech_table_other_description
source: I also know some “older” technologies like WPF and Windows Forms. My curiosity led me to IoT and, together with game development, to designing AI characters.
cs: Znám i „starší“ technologie jako WPF a Windows Forms. Zvědavost mě dovedla k IoT a ve spojení s vývojem her také k návrhu AI postav.

# resource_common_tech_table_currently_learning_description
source: Always learning.
cs: Stále se učím.
